"use client";
import { Button } from "@components/ui/button";
import { MessageCircleQuestionIcon, PhoneCall } from "lucide-react";
import Image from "next/image";
import Link from "next/link";
import ReactWhatsapp from "react-whatsapp";

const About = () => {
  return (
    <div className="flex h-full min-h-screen w-full flex-col items-center">
      <h1 className="mt-2 inline-flex h-[40px] w-full animate-shimmer items-center justify-center border border-slate-800 bg-[linear-gradient(110deg,#220103,45%,#1e2631,55%,#000103)] bg-[length:200%_100%] px-6 font-medium text-white transition-colors hover:text-orange-600 focus:outline-none focus:ring-2 focus:ring-slate-400 focus:ring-offset-2 focus:ring-offset-slate-50">
        ПОЛИТИКА ОТНОСНО БИСКВИТКИ НА www.myride.bg
      </h1>

      <section
        id="otgovornost"
        className="text-wrap flex min-h-screen w-full flex-col items-center justify-center gap-4 p-4 text-white"
      >
        <p>&nbsp;</p>
        <p>Последна актуализация 07/2024 г.</p>
        <p>
          <strong>КАКВО СА БИСКВИТКИТЕ?</strong>
        </p>
        <p>
          Бисквитките (cookies) са малки файлове с данни, които се поставят във
          вашия компютър или устройство от вашия браузър. Бисквитките позволяват
          на уеб сървърите да прехвърлят данни към даден компютър или устройство
          за архивиране и други цели. С помощта на бисквитките даден уебсайт
          може да стане по-лесен за ползване. Самите бисквитки не могат сами да
          събират данни, съхранявани на вашия компютър или във вашите файлове.
          Можете да инструктирате браузъра си да откаже всички бисквитки или да
          посочи кога се изпраща бисквитка. Ако обаче не приемете
          &bdquo;бисквитки&ldquo;, може да не успеете да използвате някои части
          от нашата услуга. Освен ако не сте настроили настройките на Вашия
          браузър така, че да отказва бисквитки, нашата Услуга може да използва
          бисквитки.
        </p>
        <p>
          Определени видове бисквитки или подобни на бисквитки функции могат да
          бъдат поставени или активирани чрез добавки на браузъра, включително,
          но не само, Adobe Flash. Въпреки че тези бисквитки се съхраняват по
          различен начин, тяхната функционалност и предназначение като цяло са
          подобни на другите бисквитки.
        </p>
        <p>
          <strong>КАКВИ ОСНОВНИ ВИДОВЕ БИСКВИТКИ СЪЩЕСТВУВАТ?</strong>
        </p>
        <p>Бисквитките могат да бъдат:</p>
        <p>
          <strong>Сесийни (&ldquo;session&rdquo;)</strong> са временни
          бисквитки, които съществуват само докато не затворите браузъра.
        </p>
        <p>
          <strong>Постоянните бисквитки (&ldquo;persistent&rdquo;)</strong>{" "}
          остават на вашия твърд диск или устройство докато не ги изтриете или
          докато не им изтече продължителността на живота. Тези бисквитки се
          използват за обезпечаване на сигурността, за улесняване на
          навигацията, за по-ефикасно представяне на информация на екрана и за
          да може да ви се предостави по-добро обслужване чрез
          по-персонализирана информация.
        </p>
        <p>
          <strong>
            Задължителните бисквитки (&ldquo;essential cookies&rdquo;)
          </strong>{" "}
          са абсолютно необходими, за да може уебсайта да извършва основните си
          функции. Тези бисквитки ви дават възможност да навигирате в уебсайта и
          да използвате функциите, които ви интересуват, като например достъп до
          сигурни страници в уебсайта. Без тези бисквитки, не може да ви се
          предоставят услугите, които позволяват на уебсайта да функционира.
          Например тези бисквитки ни позволяват да разпознаем, че сте създали
          акаунт и сте влезли в него.
        </p>
        <p>
          <strong>Бисквитките за ефективност (performance cookies)</strong>{" "}
          събират анонимна информация за начина, по който посетителите използват
          уебсайта. Тези бисквитки помагат да се разбере как посетителите
          използват уебсайта като предоставят информация за посетените страници,
          времето прекарано на уебсайта и проблемите, които може да са се
          появили, като например съобщения за грешка. Тази информация помага да
          се подобри ефективността на уебсайта.
        </p>
        <p>
          <strong>Аналитични бисквитки</strong> - тези бисквитки позволяват на
          нас и услугите на трети страни да събираме обобщени данни за
          статистически цели за това как нашите посетители използват уебсайта.
          Тези бисквитки не съдържат лична информация като имена и имейл адреси
          и се използват, за да ни помогнат да подобрим вашето потребителско
          изживяване на уебсайта.
        </p>
        <p>
          <strong>Функционалните бисквитки (functionality cookies)</strong>{" "}
          служат за подобряване на вашите посещения на уебсайта. Тези бисквитки
          могат, например, да запаметят информация като вашето потребителско
          име, език или предпочитано местоположение. Запомнянето на вашите
          избори позволява на уебсайта да Ви предоставя услуги с по-богати и
          по-персонализирани характеристики.
        </p>
        <p>
          <strong>Рекламни бисквитки</strong> &ndash; те се използват за
          проследяване на посетителите на уебсайта, за да придобие представа за
          интересите им на базата на посетените сайтове, за да могат да
          предложат подходящи за съответния посетител реклами. Рекламни
          бисквитки се поставят на вашия компютър от рекламодатели и рекламни
          сървъри с цел показване на реклами, които най -вероятно ще
          представляват интерес за вас. Тези бисквитки са свързани с компютър и
          не събират никаква лична информация за вас.
        </p>
        <p>&nbsp;</p>
        <p>
          <strong>КАКВИ ВИДОВЕ БИСКВИТКИ ИЗПОЛЗВА ТОЗИ УЕБСАЙТ?</strong>
        </p>
        <p>
          Нашите бисквитки са &bdquo;бисквитки от първа страна&ldquo; и могат да
          бъдат постоянни или временни. Това са необходими бисквитки, без които
          Сайтът няма да работи правилно или няма да може да предоставя
          определени функции и функционалности. Някои от тях може да бъдат
          деактивирани ръчно във вашия браузър, но могат да повлияят на
          функционалността на Сайта.
        </p>
        <p>
          <strong>Задължителни бисквитки</strong>
        </p>
        <p>
          Предназначение: Ние използваме зaдължитeлни бисквитки, които са нужни
          зa нopмaлнaтa paбoтa нa yeбcaйтa и нe мoгaт дa бъдaт изĸлючвaни. Тези
          бисквитки са от съществено значение, за да Ви предоставят услуги,
          достъпни чрез уебсайта и да Ви позволят да използвате някои от
          неговите функции. Те помагат за удостоверяване на потребителите и
          предотвратяват измамно използване на потребителски акаунти. Без тези
          бисквитки услугите, които сте поискали, не могат да бъдат предоставени
          и ние използваме тези бисквитки само за да Ви предоставим тези услуги.
        </p>
        <p>
          <strong>Функционални бисквитки</strong>
        </p>
        <p>
          Предназначение: - Те позволяват анализа на използваемостта на сайта и
          оптимизиране на работата му. Измерват броя на посещенията, кои
          страници са посещавани, източниците на трафик, обща информация за
          размер на екран, вид браузър и др. Събираната инфopмaция e
          aнoнимнa.Тези бисквитки ни позволяват да запомним изборите, които
          правите, когато използвате уебсайта, като например запомнянето на
          вашите данни за вход или езикови предпочитания. Целта на тези
          &bdquo;бисквитки&ldquo; е да Ви предоставят по-лично преживяване и да
          Ви избегнат да въвеждате отново предпочитанията си всеки път, когато
          използвате Уебсайта.
        </p>
        <p>
          <strong>Бисквитки за персонализиране</strong>
        </p>
        <p>
          Бисквитките за персонализиране се използват за разпознаване на
          многократни посетители на Сайта. Ние използваме тези
          &bdquo;бисквитки&ldquo;, за да записваме вашата история на сърфиране,
          посетените от вас страници и вашите настройки и предпочитания всеки
          път, когато посещавате Сайта.
        </p>
        <p>
          <strong>Бисквитки за сигурност</strong>
        </p>
        <p>
          Бисквитките за сигурност помагат за идентифициране и предотвратяване
          на рискове за сигурността. Ние използваме тези &bdquo;бисквитки&ldquo;
          за удостоверяване на потребителите и защита на потребителските данни
          от неоторизирани страни.
        </p>
        <p>
          <strong>Бисквитки за управление на сайта</strong>
        </p>
        <p>
          Бисквитките за управление на сайта се използват за поддържане на
          вашата самоличност или сесия на Сайта, така че да не сте излезли
          неочаквано и всяка информация, която въведете, се запазва от страница
          на страница. Тези &bdquo;бисквитки&ldquo; не могат да се изключват
          поотделно, но можете да деактивирате всички &bdquo;бисквитки&ldquo;
          във вашия браузър.
        </p>
        <p>&nbsp;</p>
        <p>
          <strong>Ние използваме още:</strong>
        </p>
        <p>
          <img
            src="blob:https://wordhtml.com/4c7967e7-21db-4d77-91ad-59a29b4d9d66"
            alt="pastedGraphic.png"
          />
        </p>
        <p>&nbsp;</p>
        <p>
          <strong>КОЛКО ВРЕМЕ СЕ СЪХРАНЯВАТ БИСКВИТКИТЕ?</strong>
        </p>
        <p>
          Сесийни бисквитки се съхраняват за продължителността на сесията на
          браузъра; когато затворите браузъра, бисквитката се изтрива.
        </p>
        <p>
          Постоянни бисквитки се съхраняват за предварително зададен период от
          време (често между 90 дни и две години, в зависимост от приложението)
          и обикновено не се изтриват при затваряне на сесия на браузъра.
        </p>
        <p>
          Вашият избор може да повлияе на това дали използваме сесийни или
          постоянни бисквитки за конкретно приложение. Например, ако изберете
          &bdquo;Запомни ме&ldquo;, състоянието ви на потвърждаване в две стъпки
          се съхранява в постоянна бисквитка за 30 дни, за да запомни
          устройството, от което сте влезли.
        </p>
        <p>&nbsp;</p>
        <p>
          <strong>КАК ИЗПОЛЗВАМЕ БИСКВИТКИТЕ НА ТРЕТИ СТРАНИ</strong>
        </p>
        <p>
          Освен бисквитките, намиращи се на нашия уебсайт, ние също позволяваме
          на някои трети страни да поставят и имат достъп до бисквитки на вашия
          компютър. Тези &bdquo;бисквитки&ldquo; се интегрират от социални
          платформи като Facebook, Instagram, WhatsApp. и др. и целят да
          осигурят или подобрят съдържанието на уебсайта. Употребата на
          бисквитки от тези компании се ръководи от техните политики за
          конфиденциалност, не от Политиката за конфиденциалност на
          www.myride.bg.
        </p>
        <p>
          Ние нямаме достъп или контрол върху бисквитките или други функции,
          които сайтовете на трети страни могат да използват, и информационните
          практики на тези уебсайтове на трети страни не са обхванати от нашата
          Политика за поверителност или тази Политика за бисквитки.
        </p>
        <p>&nbsp;</p>
        <p>
          <strong>КОЛКО ВРЕМЕ СЕ ПАЗИ ИНФОРМАЦИЯТА?</strong>
        </p>
        <p>
          Информацията се запазва в зависимост от типа бисквитки. При сесийните
          тя се изтрива при затварянето на браузъра, докато постоянните са
          валидни между два и няколко месеца.
        </p>
        <p>&nbsp;</p>
        <p>
          <strong>УПРАВЛЯВАНЕ И ИЗТРИВАНЕ НА БИСКВИТКИ</strong>
        </p>
        <p>
          Ако не желаете да се събират данни за вас чрез употребата на
          бисквитки, има лесна процедура във вашите браузъри, която ви позволява
          да откажете употребата на бисквитки. Някои от елементите на уеб сайта
          може да не функционират правилно, ако откажете употребата на
          бисквитки. За подробна информация посетете www.aboutcookies.org
        </p>
        <p>&nbsp;</p>
        <p>
          <strong>Управление на бисквитките</strong>. Повечето браузъри
          автоматично приемат бисквитки по подразбиране, но можете да коригирате
          настройките на устройството и/или браузъра си, за да изтриете и/или
          блокирате някои или всички бисквитки, или да предоставите известия,
          когато получите нова бисквитка. Консултирайте се с менютата
          &bdquo;Помощ&ldquo;, &bdquo;Инструменти&ldquo; или
          &bdquo;Предпочитания&ldquo; на вашия браузър или документацията за
          вашето устройство за повече информация как да направите това. Моля,
          имайте предвид обаче, че блокирането или изтриването на определени
          бисквитки може да повлияе негативно на вашето потребителско
          изживяване.
        </p>
        <p>
          Освен това можете като цяло да деактивирате или изтриете бисквитките,
          поставени и използвани от добавките на браузъра, като бисквитките на
          Adobe Flash, като промените настройките на добавката или посетите
          уебсайта на нейния доставчик. Информация и контроли, които ви
          позволяват да управлявате бисквитките на Adobe Flash, могат да бъдат
          намерени на тази страница.
        </p>
        <p>&nbsp;</p>
        <p>
          <strong>
            Собственикът не носи отговорност, ако интернет браузърът ви не
            поддържа функциите за контрол на употребата, отказ от запаметяване
            или изтриване на запаметени бисквитки.
          </strong>
        </p>
        <p>&nbsp;</p>
      </section>

      <Image
        className="mb-4 mt-4 shadow-xl shadow-orange-500"
        src="/myride_logo.png"
        alt=""
        width={300}
        height={300}
      />
      <div className="flex flex-col items-center justify-center gap-2 md:grid md:flex-none md:grid-cols-2">
        <Button
          className="inline-flex h-[40px] animate-shimmer items-center justify-center rounded-md border border-slate-800 bg-[linear-gradient(110deg,#220103,45%,#1e2631,55%,#000103)] bg-[length:200%_100%] px-6 font-medium text-white transition-colors hover:text-orange-600 focus:outline-none focus:ring-2 focus:ring-slate-400 focus:ring-offset-2 focus:ring-offset-slate-50"
          variant="outline"
          size="sm"
        >
          <a
            className="flex animate-pulse items-center justify-center gap-1"
            href="tel:+359876995555"
          >
            Получи информация <PhoneCall className="h-4 w-4" />
          </a>
        </Button>

        <Button
          className="inline-flex h-[40px] animate-shimmer items-center justify-center rounded-md border border-slate-800 bg-[linear-gradient(110deg,#220103,45%,#1e2631,55%,#000103)] bg-[length:200%_100%] px-6 font-medium text-white transition-colors hover:text-orange-600 focus:outline-none focus:ring-2 focus:ring-slate-400 focus:ring-offset-2 focus:ring-offset-slate-50"
          size="sm"
        >
          <ReactWhatsapp
            className="flex animate-pulse items-center justify-center gap-1"
            element="webview"
            number="+359876995555"
            message={`Здравейте, интересувам се от закупуването на автомобил от Myride.bg`}
          >
            Изпрати запитване <MessageCircleQuestionIcon className="h-4 w-4" />
          </ReactWhatsapp>
        </Button>
      </div>
    </div>
  );
};

export default About;
