import { Button } from "@components/ui/button";

const About = () => {
  return (
    <div className="flex h-full min-h-screen w-full flex-col items-center">
      <h1 className="text-center text-2xl text-white">За нас </h1>
      <p className="p-2 text-xl text-white">Кратка информация</p>
      <div className="flex w-full flex-col items-center justify-center gap-4 p-4 text-white">
        <p>
          Започнахме нашата дейност преди 10 години с внос на автомобили, които
          препродавахме след внимателен подбор и осигуряване на най-добри цени.{" "}
        </p>{" "}
        С времето разширихме дейността си и започнахме да внасяме автомобили и
        за наши приятели и клиенти.{" "}
        <p>
          През последните две години се специализирахме в организирането на
          цялостния процес по внос на автомобили, включително и изготвянето на
          необходимата документация.{" "}
        </p>
        Освен това, предлагаме ремонтни услуги, като изпълняваме желанията на
        клиентите за подобрения и поддръжка на техните автомобили.{" "}
        <p>
          {" "}
          Нашият опит и ангажимент към качество ни позволяват да предоставим на
          клиентите си надеждни и висококачествени автомобили, като същевременно
          се грижим за всеки детайл от процеса – от избора и вноса до ремонта и
          поддръжката.
        </p>
        Ние гарантираме професионализъм и внимание към всяко ваше изискване.
        Свържете се с нас и нека ви помогнем да намерите перфектния автомобил,
        съобразен с вашите нужди и желания.
      </div>
      <p className="flex w-full items-center justify-center text-xl uppercase text-white">
        Myride.BG - "Антъни 15" ЕООД - гр. Благоевград
      </p>
      <div className="flex w-full items-center justify-center gap-4">
        <Button>Свържете се с нас</Button>
        <Button>Направете запитване</Button>
      </div>
    </div>
  );
};

export default About;
